# x1 = 12
# x2 = 12.1
# x3 = '15'
# x4 = True
# print(x1,x2,x3,x4)

# x1 = str(input('Напиши свое имя:'))
# x2 = int(input('Напиши сколько тебе лет:'))
# print('Ты',x1,"и тебе",x2,")")

# x1 = 342
# x2 = 56.2
# x3 = '43'
# x4 = float(x3) + x1 + x2
# print(x4)

# a =3
# b = 8
# print((a + 4 * b)*(a - 3 *b) + a**2)

# a = int(input('Напиши длину прямоугольника: '))
# b = int(input('Напиши ширину прямоугольника: '))
# print(f'Периметр прямоугольника: {a+a+b+b} Площадь будет: {a*b}')

# print('*   *   *')
# print('  *****')
# print('  *  *')

# x1 = ('Съешь еще ')
# x2 = ('этих мягких ')
# x3 = ('французких булок, ')
# x4 = ('да выпей ')
# x5 = ('чаю')
# print(x1+x2+x3+x4+x5)

# print("да! нет! "*4)

# x = input()
# x = x.replace(',',' ').split()
# print((int(x[0]) + int(x[2]))//int(x[1]))

# x = input()
# print(x[0:4],x[-2:],x[4:8],x[::-1]) #Включительно до 8? Если нет, то x[4:7]
